{"title": "Apps de Android no Google Play terão que explicar o que fazem com seus dados | Aplicativos e Software | Tecnoblog", "author": "Ana Marques", "text": "Seguindo os passos da Apple, o Google vai pedir que aplicativos de Android disponíveis na Play Store mostrem detalhes sobre os dados que coletam de seus usuários – uma forma de tornar mais transparente o tratamento e as políticas de privacidade aplicadas a informações sensíveis. A mudança foi anunciada nesta quinta-feira (06), e está prevista para entrar em vigor em 2022.Google Play enfim tenta combater apps enganosos no AndroidAndroid compartilha 20x mais dados com Google do que iOS com Apple, diz estudoApp da Google Play Store no Android (Imagem: André Fogaça/Tecnoblog)De acordo com um comunicado postado pelo Google no blog para desenvolvedores, a nova seção de segurança da Play Store permitirá aos usuários saber quais dados os aplicativos estão coletando ou compartilhando com terceiros, o nível de proteção oferecida e outros detalhes sobre privacidade.Além disso, ao submeter um novo app, o desenvolvedor precisa responder às seguintes questões:O aplicativo tem práticas de segurança, como criptografia de dados?O aplicativo segue a política para famílias da Play Store?O aplicativo precisa desses dados para funcionar ou os usuários podem optar por não compartilhá-los?A seção de segurança do aplicativo é verificada por um terceiro independente?O aplicativo permite que os usuários solicitem a exclusão de dados, se decidirem desinstalar?O que a nova seção de segurança irá exibir?Quando a mudança estiver no ar, os usuários poderão ver na página de cada app da Play Store quais tipo de dados são coletados e armazenados (como informações sobre localização, nome, endereço de e-mail) e como os dados são usados (são necessários para funcionar? Para personalizar a experiência?).De acordo com o Google, se um desenvolvedor, de alguma forma, fornecer informações que não condizem com a realidade, ele irá violar a política da Play Store e, quando descoberto, será notificado para corrigir o problema.O Google afirma que todos os aplicativos da Play Store, incluindo os próprios apps da empresa, deverão compartilhar essas informações e ter uma política de privacidade declarada.Quando a mudança entrará em vigor?Cronograma do Google para mudança na Play Store (Imagem: Reprodução/Google)Por se tratar de uma mudança de grande impacto e importância, o Google está dando um ano para que os desenvolvedores se adaptem às novas regras – prazo maior do que o fornecido pela Apple, inclusive, o que fez com que até o próprio Google demorasse para “entrar na linha”.De acordo com a empresa responsável pelo Android, as exigências passarão a valer a partir do segundo trimestre de 2022, tanto para novos envios quanto para atualizações de apps em sua plataforma.Com informações: Google", "link": "https://tecnoblog.net/439887/apps-de-android-no-google-play-terao-que-explicar-o-que-fazem-com-seus-dados/"}
{"title": "Prévia do Windows 10 traz fonte atualizada e mais fácil de ler | Aplicativos e Software | Tecnoblog", "author": "Ana Marques", "text": "A Microsoft lançou, nesta quinta-feira (06), uma nova prévia do Windows 10 para membros do canal Dev no programa Insider. A build 21376 traz poucas novidades, mas há um destaque para a mais recente variante da fonte Segoe UI, que promete funcionar bem em todos os tamanhos, dos menores aos maiores.Windows 10 vai enfim trocar ícones que não mudam desde Windows 95 e 98Microsoft vai escolher nova fonte padrão do Office e quer sua ajudaSegoe UI Variable (Imagem: Divulgação/Microsoft)Originalmente, a Segoe UI foi projetada para funcionar em 9pt e, por isso, entrega boa experiência com este tamanho. Entretanto ela não tinha uma exibição tão boa em tamanhos grandes e oferecia legibilidade prejudicada em textos ainda menores que 9pt.De acordo com a Microsoft, a Segoe UI Variable é uma atualização da Segoe clássica, com legibilidade aprimorada e melhores contornos. A nova fonte usa uma tecnologia de fonte variável que se adapta de forma dinâmica a diferentes tamanhos.Além disso, a fonte Segoe UI Historic está ganhando suporte ao Bamum Unicode.Outras novidades da prévia do Windows 10 (build 21376)Além das mudanças na fonte, a prévia do Windows 10 traz uma série de correções para bugs e pequenos ajustes em outras partes gráficas, o que inclui alterações no design do curso ao arrastar e soltar, e um novo ícone para o app Conectar, mais alinhado à linha visual revelada recentemente para os ícones do sistema.Vale reforçar que tudo isso chega ao canal Dev, logo não há necessariamente uma garantia de que eles estarão prontos na versão final (o update Sun Valley) esperada para o segundo semestre deste ano. Já o canal Beta, para os early adopters de plantão, segue com o Windows 10 May 2021 (21H1).Com informações: Microsoft e XDA Developers", "link": "https://tecnoblog.net/439836/previa-do-windows-10-traz-fonte-atualizada-e-mais-facil-de-ler/"}
{"title": "Samsung revela novas soundbars: Q950A tem 11.1.4 canais por R$ 8.299 | Tecnoblog", "author": "Paulo Higa", "text": "Além de renovar a linha de TVs para 2021, a Samsung revelou nesta quinta-feira (6) quatro modelos de soundbar no Brasil. A T450 entra como o novo modelo básico com subwoofer para quem procura graves mais profundos, enquanto a Q600A, a Q800A e a Q950A chegam com Dolby Atmos para aumentar a imersão sonora. A Q950A, mais completa de todas, tem 11.1.4 canais e preço sugerido de R$ 8.299 (!).Como comprar um soundbar? [Guia & Dicas]Samsung AU8000 e AU7700 são as novas TVs 4K básicas com até 85 polegadasSoundbar Samsung HW-Q950A (Imagem: Divulgação/Samsung)Soundbar Samsung Q950A tem Alexa, Dolby Atmos e caixas traseirasA Q950A, apesar de ser vendida como soundbar, acaba lembrando mais um home theater: além da barra de som para ser colocada na frente da TV, ela traz um subwoofer wireless de 8 polegadas e duas caixas de som traseiras de quatro canais para espalhar o som pelo ambiente. A sensação de tridimensionalidade é completada pelo Dolby Atmos (tecnologia que curiosamente não é destacada nas TVs da marca) e pelo DTS:X.Soundbar Samsung HW-Q950A (Imagem: Divulgação/Samsung)Os 22 speakers da Q950A formam uma potência total de 616 watts e suportam o recurso de Sincronia Sonora, disponível nas TVs QLED mais novas, que junta o som integrado da TV com a potência da soundbar. Essa tecnologia era chamada de Q Symphony até o ano passado, mas foi renomeada para se tornar mais intuitiva no Brasil.É possível parear o seu celular para tocar músicas por Bluetooth, ou então pedir para a Alexa embutida reproduzir uma playlist. Diz a Samsung que, com o SpaceFit Sound+, a soundbar traz sensores que “avaliam automaticamente o ambiente e calibram o campo sonoro para se adequar perfeitamente à sua sala”.Só que tudo isso custa R$ 8.299, que é o valor de uma TV high-end de 65 polegadas, então a Samsung também lançou modelos com preços menos caros para pessoas mais normais. A Q800A tem 3.1.2 canais, 330 watts, Dolby Atmos e Alexa integrada por R$ 3.999, enquanto a Q600A mantém especificações sonoras semelhantes, mas perde a Alexa e sai por R$ 3.099. Em ambas é possível se conectar via Bluetooth, e o subwoofer se liga à barra principal sem necessidade de fios.Soundbar Samsung HW-Q800A (Imagem: Divulgação/Samsung)Samsung T450 é um modelo mais básico com 2.1 canais por R$ 1.299Mas mesmo uma soundbar mais simples já melhora bastante a experiência sonora em comparação com os alto-falantes integrados da TV, e a T450 é a opção de entrada da Samsung para 2021: você não encontra Dolby Atmos, Wi-Fi ou HDMI aqui, apenas uma barra com subwoofer wireless em 2.1 canais que pode ser conectada à TV por um cabo óptico.Soundbar Samsung HW-T450 (Imagem: Divulgação/Samsung)A T450 promete som surround e 200 watts de potência, podendo reproduzir conteúdos a partir de um dispositivo com Bluetooth (que pode ser um celular ou até a própria TV, se você não gosta de cabos) ou uma mídia ligada na porta USB integrada. Com preço sugerido de R$ 1.299, ela fica logo abaixo da T555, que continuará sendo vendida no Brasil até o final de 2021.", "link": "https://tecnoblog.net/439794/samsung-revela-novas-soundbars-q950a-tem-11-1-4-canais-por-r-8-299/"}
{"title": "Google lança Entertainment Space para Android com vídeos, jogos e livros | Aplicativos e Software | Tecnoblog", "author": "Emerson Alecrim", "text": "Tablets Android não são populares como os smartphones baseados na plataforma. Mesmo assim, vez ou outra eles recebem uma atenção maior do Google. Nesta semana, por exemplo, a companhia anunciou o Entertainment Space, ferramenta que funciona como hub de entretenimento nesses dispositivos.3 emuladores de Android para rodar games no PC[Review] Samsung Galaxy Tab S7: para quem faz questão de tablet AndroidEntertainment Space (imagem: divulgação/Google)O próprio Google dá pistas sobre o porquê desse lançamento. A companhia destaca que, em 2020, a procura por tablets Android cresceu 30% em relação ao ano anterior. Certamente, esse aumento de demanda foi efeito da pandemia. Passando mais tempo em casa, muita gente comprou dispositivos variados, incluindo tablets, para consumir conteúdo.A proposta do Entertainment Space é permitir que o usuário receba sugestões de vídeos, jogos e livros facilmente. Para isso, no topo do aplicativo, o usuário encontra botões para alternar entre as três categorias: Watch (Assistir), Games (Jogos) e Read (Ler).Na categoria Watch, a ferramenta é capaz de indicar filmes ou séries em diversas plataformas, como Netflix, Disney+, Hulu, Twitch e, claro, YouTube. Não deve ser por acaso que a interface lembra a do Chromecast com Google TV.Na área Games, o usuário encontra sugestões de títulos para jogar ou instalar em destaque e, mais abaixo, ícones para retomar jogos em andamento. A aba Read tem uma abordagem parecida, com a diferença de mudar o conteúdo para livros do Google Play Books — audiobooks também podem ser encontrados por lá.Área de livros do Entertainment Space (imagem: divulgação/Google)O Entertainment Space é um aplicativo “menos um” (-1), ou seja, ocupa a área à esquerda da tela inicial do Android e, portanto, substitui a ferramenta Discover, padrão na plataforma.De acordo com o Google, a novidade fará o usuário economizar tempo ao buscar conteúdo para assistir, jogar ou ler. No começo, é preciso passar por uma configuração para permitir que serviços de mídia variados se integrem à ferramenta. Essa configuração poderá ser alterada a qualquer momento.Para tablets compartilhados entre duas ou mais pessoas, o Entertainment Space permite criação de múltiplos perfis para que cada um receba sugestões personalizadas de conteúdo.Jogos no Entertainment Space (imagem: divulgação/Google)Entertainment Space: disponibilidadeO Entertainment Space vai ser disponibilizado a partir deste mês em tablets Onn, do Walmart. Nos próximos meses, a novidade chegará a tablets da Lenovo e Sharp.Modelos de outras marcas poderão receber a ferramenta ainda em 2021, mas isso dependerá do interesse de cada fabricante.Com informações: Engadget.", "link": "https://tecnoblog.net/439793/google-lanca-entertainment-space-videos-jogos-livros-tablets-android/"}
{"title": "Itaú, líder em carteiras digitais, também quer dominar WhatsApp Pagamentos | Negócios | Tecnoblog", "author": "Felipe Ventura", "text": "O WhatsApp Pagamentos foi liberado novamente no Brasil esta semana, e com mais bancos parceiros do que antes: desta vez também estão participando o Mercado Pago, Inter, Bradesco e mais grandes bancos. Um deles é o Itaú, que está com um objetivo ambicioso: se tornar o líder nessa forma de transações. Nas carteiras digitais Samsung Pay, Apple Pay e Google Pay, ele já responde pela maior parte do faturamento.Como ativar o WhatsApp Pay na sua conta [Pagamentos]Como enviar e receber pagamentos pelo WhatsApp PayWhatsApp Pagamentos (Imagem: Divulgação)Rubens Fogli, diretor de pagamentos e negócios digitais do Itaú, revelou esse objetivo em entrevista ao Tecnoblog. Segundo ele, a ideia é oferecer uma melhor experiência ao cliente, e a estratégia é pensar no longo prazo.Fogli cita como exemplo o Apple Pay: os bancos brasileiros estavam hesitando em oferecer suporte; sabe-se que a Apple cobra uma taxa das instituições financeiras. O Itaú achou que deveria entrar nessa e fez o lançamento em 2018; dois anos depois, tivemos outra parceria entre as duas empresas – o programa iPhone pra Sempre.Itaú lidera no Samsung, Google e Apple PayHoje, o Itaú responde por mais de 70% de participação no faturamento das carteiras digitais da Samsung, Google e Apple. De todos os cartões cadastrados, 35% são do banco.O número de clientes do Itaú registrados nessas carteiras mais que triplicou de 2019 a 2021, indo de 2 milhões para 6,5 milhões. Fogli observa que, quando as pessoas cadastram o cartão nesses serviço, dificilmente tiram.Vale notar que mesmo produtos gratuitos, como a iConta e cartões de crédito sem anuidade, podem utilizar carteiras como o Apple Pay. O executivo afirma que o Itaú não vê isso como produtos separados, e “quer todos os clientes na mesma jornada”.Itaú no Apple Pay (Imagem: Tecnoblog)Para Fogli, a integração ao WhatsApp fecha um ciclo de big techs, desta vez com um alcance maior que Google, Samsung e Apple. O aplicativo tem mais de 2 bilhões de usuários em todo o mundo, e está presente em 99% dos celulares brasileiros.O WhatsApp Pay atualmente só permite transações P2P (peer-to-peer), ou seja, de uma pessoa para outra. O próximo passo será comprar e vender produtos com pagamento pelo app, ou P2M (pay-to-merchant). O diretor do Itaú diz ao Tecnoblog que o banco já está tecnicamente pronto para implementar isso.", "link": "https://tecnoblog.net/439530/itau-lider-em-carteiras-digitais-tambem-quer-dominar-whatsapp-pagamentos/"}
{"title": "Sony e Valve são processadas sob acusação de monopólio em lojas de jogos | Jogos | Tecnoblog", "author": "Murilo Tunholi", "text": "A Sony e a Valve foram processadas sob acusações de praticarem monopólio com suas lojas de jogos digitais, a PlayStation Store e o Steam, respectivamente. Enquanto a ação coletiva contra a Sony foi movida por jogadores, a Valve foi denunciada pela Wolfire Games, criadora do projeto Humble Bundle. Os dois processos foram motivados pela guerra judicial entre Epic Games, Apple e Google.Processo Epic vs. Apple revela faturamento de Fortnite e mais detalhesComo baixar jogos grátis da Epic Games StorePS Store no PS5 (Imagem: Reprodução/PlayStation 5)A ação judicial contra a SonySegundo o Bloomberg, a Sony está sendo acusada de praticar monopólio por só permitir a venda de jogos digitais na PlayStation Store. Essa exclusividade começou em 1º de abril de 2019, quando a japonesa proibiu a comercialização de cartões com códigos de download de games em lojas terceirizadas.Na ação coletiva, os jogadores alegaram que a PS Store se tornou a única loja de jogos digitais para os consoles PlayStation. Com isso, a Sony estaria agindo de forma ilegal, pois a somente empresa poderia decidir os preços dos games, sem se preocupar com a concorrência.O monopólio da Sony permite cobrar preços não competitivos em jogos digitais nos consoles PlayStation, que são mais caros do que as edições físicas dos mesmos games vendidas em um mercado que permite competitividade, e mais caros do que seriam em um mercado competitivo de mídias digitais.Autores do processo contra a Sony.Ainda de acordo com a ação, os consumidores estariam pagando até 175% a mais por jogos digitais em comparação com as versões em mídia física dos mesmos títulos.O processo judicial contra a ValvePromoção de jogos no Steam (Imagem: Murilo Tunholi/Tecnoblog)Já a Valve foi processada pela Wolfire Games, desenvolvedora de jogos independentes e criadora do projeto Humble Bundle. A empresa acusou a dona do Steam de praticar monopólio no mercado de jogos para PC e usar essa situação para cobrar a taxa de 30% sobre as vendas dentro da plataforma.“A Valve abusa do seu poder no mercado para garantir que as publicadoras de jogos não tenham escolha senão vender os games pela loja do Steam, onde estão sujeitas à taxa de 30% da Valve”, argumentou a Wolfire Games.A desenvolvedora de games indie afirmou que a Valve controla 75% do mercado de jogos para PC. Para a Wolfire Games, a Epic Games e a Microsoft precisaram diminuir as taxa de publicação para 12% nas suas lojas apenas para tentar competir com o Steam.Vale mencionar que o Humble Bundle é um serviço de caridade em que os usuários pagam uma certa quantia e podem resgatar pacotes com jogos independentes e até de grandes estúdios. Esses games são resgatados no Steam.Com informações: GameInformer, GameIndustry.biz, Kotaku.", "link": "https://tecnoblog.net/439805/sony-e-valve-sao-processadas-sob-acusacao-de-monopolio-em-lojas-de-jogos/"}
{"title": "The Division, da Ubisoft, terá jogo gratuito e versão mobile | Jogos | Tecnoblog", "author": "Murilo Tunholi", "text": "A Ubisoft revelou dois novos jogos em desenvolvimento da franquia The Division: o game grátis The Division Heartland e um título mobile ainda sem nome. Os anúncios fazem parte do cronograma de lançamentos da série, que também inclui DLCs para The Division 2, um livro e o filme produzido em parceria com a Netflix.Como jogar The Division 2 [Guia para iniciantes]Como jogar Assassin’s Creed Odyssey [Guia para iniciantes]The Division Heartland (Imagem: Divulgação/Ubisoft)The Division Heartland será um jogo de tiro free-to-play (grátis para jogar). A Ubisoft não explicou se o game é um Battle Royale, como Fortnite, ou se deve seguir o estilo dos títulos principais da franquia, com foco em modos cooperativos.A previsão de lançamento é entre o final de 2021 e 2022. O game vai chegar para consoles, PCs e plataformas de jogos em streaming, como GeForce Now e Xbox xCloud. A Ubisoft não comentou se o título será exclusivo da nova geração de videogames.Até o momento, a Ubisoft só tem Hyper Scape como representante no mercado de jogos Battle Royale. O game, porém, não compete com a receita bilionária de Fortnite, nem com os milhões de usuários nos títulos da franquia Call of Duty, como COD: Warzone e COD: Mobile.Sobre o jogo para celulares, a produtora ainda não revelou o nome, nem disse como será a jogabilidade. A Ubisoft prometeu novidades sobre o game em breve.Cronograma de lançamentos de The Division (Imagem: Divulgação/Ubisoft)The Division 2 terá DLC, filme e livroThe Division 2 receberá um conteúdo adicional que, segundo a Ubisoft, vai incluir um modo de jogo inédito na franquia e novas formas de evoluir os agentes, permitindo builds diferentes e viáveis. O DLC será lançado ainda em 2021.Já o filme em live-action de The Division segue sendo produzido em parceria com a Netflix. Estrelado por Jessica Chastain e Jake Gyllenhaal, o longa é dirigido por David Leitch, responsável por Deadpool 2.Por fim, o livro contará uma história original após os eventos de The Division 2 e vai explorar os efeitos da pandemia em diferentes locais dos Estados Unidos. A Ubisoft não revelou o nome do autor da obra, nem a data de lançamento.Com informações: Ubisoft, The Verge.", "link": "https://tecnoblog.net/439840/the-division-da-ubisoft-tera-jogo-gratuito-e-versao-mobile/"}
{"title": "Google dá nova pista de que Pixel 6 terá processador próprio Whitechapel | Tecnoblog", "author": "André Fogaça", "text": "No mês passado nós já falamos sobre um possível chip criado pelo próprio Google, com nome de Whitechapel para equipar o smartphone que deve ser o Pixel 6. Agora, pouco tempo depois, mais indícios apontam para essa direção com a ajuda de um comentário feito por alguns funcionários do gigante das buscas em um fórum de discussão do AOSP (“Projeto de Código Aberto do Android”, em tradução literal).iPhone 12 Pro Max, Galaxy Note 20 Ultra ou Pixel 5: qual tem a melhor câmera?ARM revela ARMv9, nova arquitetura de chips mais rápida e seguraGoogle Pixel 5 (Imagem: divulgação/Google)A conversa aconteceu dentro do Gerrit, durante a revisão de um código enviado ao AOSP sobre o aplicativo OsloFeedback. Ele é o responsável pelas informações captadas a partir do radar Soli, presente na grande testa do Pixel 4 e que consegue reconhecer gestos do usuário na frente do celular.Uma parte do comentário faz menção ao uso de algo chamado binder_use em um produto com código P21. Logo abaixo da frase Adam Shih, um funcionário do próprio Google, colocou um link interno da empresa que trabalha e nele existe um diretório chamado Whitechapel, com todas as letras e sem esconder qualquer detalhe do nome.Este é exatamente o mesmo código ventilado pelos rumores indicando a criação interna de um chip para o próximo Pixel, que certamente será o Pixel 6. O caminho dentro do servidor onde aponta o link é /android/device/google/gs101-sepolicy/whitechapel e outros boatos do mês passado já diziam que a parte inicial de “GS101” significa Google Silicon.Ainda com base nos rumores já conhecidos, o tal chip Whitechapel com possível código interno de GS101 deve estar não somente dentro de um ou mais smartphones lançados pelo gigante das buscas. A empresa deve seguir um caminho semelhante ao que a Samsung fez no passado com seus Exynos e a Apple vem fazendo mais recentemente com o M1 ao colocar o SoC em mais de uma plataforma. Neste caso, o componente pode aparecer tanto em versões do Pixel 6 como em algum Chromebook, quem sabe num sucessor do potente e nada barato Pixelbook – este utilizava processador Intel.Google e Samsung podem trabalhar no WhitechapelFalando sobre Samsung, alguns boatos apontam para um trabalho próximo entre Samsung e Google no desenvolvimento do Whitechapel. Se confirmados, eles podem indicar que o chip do gigante das buscas deve compartilhar alguns detalhes presentes nos Exynos criados pela empresa coreana.Este vazamento de agora não chega a revelar nenhuma informação importante sobre o chip, seja a arquitetura escolhida, quantos nanômetros ele tem, as capacidades gráficas e de velocidade para processamento, nem mesmo qual é o total de núcleos e como eles trabalham, mas ainda assim é um descuido importante para crer que o Whitechapel existe de verdade. Ele dá mais credibilidade aos rumores já ventilados recentemente sobre o Whitechapel, colocando exatamente esse nome dentro de um trabalho interno do próprio Google.A garantia da credibilidade para a informação aparecendo em comentários no AOSP está em um vazamento do passado, quando o mesmo local deu indícios sobre a presença de telas com 90 Hz em códigos internos do Android 10, que foram publicados no local.Com informações: XDA-Developers.", "link": "https://tecnoblog.net/439781/google-da-nova-pista-de-que-pixel-6-tera-processador-proprio-whitechapel/"}
{"title": "Processo revela tensão da Apple para ter assinaturas da Netflix na App Store | Negócios | Tecnoblog", "author": "Victor Hugo Silva", "text": "A disputa judicial entre Epic Games e Apple tem revelado mais detalhes da relação de desenvolvedores com a App Store. O processo revelou que a decisão da Netflix de deixar o sistema de pagamentos da loja de aplicativos criou uma tensão entre executivos da Apple, que cogitaram oferecer mais vantagens ao serviço de streaming.Microsoft queria app nativo do Xbox Cloud para iPhone, mas Apple não deixouComo ver os aplicativos que já baixei na App StoreApp Store no iPhone (Imagem: André Fogaça/Tecnoblog)Em e-mails de 2018 destacados pelo 9to5Mac, executivos da Apple discutem o que fazer para tentar convencer a Netflix de manter o suporte para assinaturas diretamente na App Store. Com o seu sistema In-App Purchase (IAP), a Apple tem direito a parte do valor pago pelos usuários. Se o pagamento é realizado em um site, a empresa perde um valor considerável.A Netflix não tinha certeza de que deveria seguir com o IAP. Segundo os e-mails, a empresa identificou que a proporção dos cancelamentos na App Store era maior do que a registrada entre quem havia assinado em outros meios, como o site. A Apple, que não queria perder a sua comissão, planejou oferecer benefícios ao serviço de streaming.O diretor de gestão de negócios da App Store, Carson Oliver, enviou um e-mail em fevereiro de 2018 para tratar do caso. Na mensagem, ele informa que a Netflix planejava remover o suporte ao IAP em alguns países durante dois meses, como parte de seus testes. A ideia, segundo o executivo, era entender como a loja da Apple contribuía com as assinaturas.“A Netflix está preocupada em entender o valor incremental de oferecer assinatura via IAP no iOS”, afirmou Oliver no e-mail. “Expressamos nossa preocupação de que a execução desse teste criaria uma experiência ruim para os usuários do aplicativo nesses mercados e limitaria as oportunidades de marketing conjunto, incluindo os destaques na loja”.Oliver também questionou se a Apple deveria adotar “medidas punitivas” contra a Netflix por conta do teste. Entre as ações consideradas, estava a remoção dos destaques ao serviço de streaming na App Store.Apple planejou benefícios para a NetflixPara convencer a Netflix a seguir com o suporte às assinaturas na App Store, os executivos planejaram oferecer vantagens ao serviço de streaming. Em uma apresentação de slides, a Apple indicou que a plataforma de filmes e séries era seu parceiro mais destacado na App Store e que os conteúdos aumentaram os downloads do app no iOS em até 7%.Em outro trecho, o documento aponta que a Apple estava disposta a ter ações coordenadas para promover conteúdos da Netflix e a liberar mais dados sobre a performance do aplicativo de streaming entre usuários de iOS. Entre as propostas, também estavam um bundle com o Apple TV, publicidade para a Netflix em Apple Stores e até mesmo uma redução nas taxas.Os e-mails não revelam se a apresentação foi enviada à Netflix, mas sabe-se que o serviço de streaming deixou oficialmente o sistema de pagamentos da App Store em dezembro de 2018. As mensagens também apontam a disposição da Apple de negociar políticas diferenciadas de acordo com o tamanho do parceiro.", "link": "https://tecnoblog.net/439708/processo-revela-tensao-da-apple-para-ter-assinaturas-da-netflix-na-app-store/"}
{"title": "Instagram Direct facilita ver se contatos leram sua mensagem | Aplicativos e Software | Tecnoblog", "author": "Victor Hugo Silva", "text": "O Instagram Direct ganhou uma atualização que ajuda a identificar mais rapidamente se um contato leu sua mensagem. Até então, a seção exigia que a conversa fosse aberta para encontrar a confirmação de leitura. Agora, ela ficou mais parecida com o Messenger e permite encontrar um aviso logo na lista de contatos.Instagram Stories segue TikTok e converte voz para texto em vídeosComo excluir Directs do Instagram [Histórico do inbox]Instagram Direct mostra na lista de conversas se mensagem foi lida (Imagem: Divulgação)Com a mudança, o Instagram Direct vai indicar na lista das conversas mais recentes se uma mensagem foi lida. A rede social de fotos vai informar se isso aconteceu recentemente ou há algumas horas. Para mensagens enviadas em grupos, a lista com as conversas também mostrará por quantas pessoas ela foi lida.A rede social também facilitou o envio de fotos e vídeos como resposta a outros arquivos de mídia enviados por um contato. Agora, ao ampliar a imagem enviada por outra pessoa, será possível tocar no ícone de câmera no canto inferior esquerdo da tela e enviar uma nova foto. Esta opção começou a ser liberada no iOS e chegará em breve ao Android.Instagram simplifica envio de fotos e vídeos como resposta (Imagem: Divulgação)Messenger facilita envio de áudiosO Messenger anunciou uma atualização para quem envia áudios de longa duração. Antes da mudança, era preciso manter o botão do microfone pressionado. Agora, o aplicativo permite que o áudio continue sendo capturado com apenas um toque no ícone. Quando ele é finalizado, é possível enviar ou apagar a gravação. A melhoria será levada em breve para o Instagram.Messenger facilita envio de áudios (Imagem: Divulgação)A atualização no Messenger simplificou o arquivamento de conversas. Na tela inicial, basta deslizar um chat para a esquerda para ocultá-lo da lista. A ideia é que o recurso ajude usuários a encontrarem as conversas que desejam mais rapidamente. Para encontrar removido da tela inicial, basta tocar em sua foto de perfil e, depois, em “Conversas arquivadas”.Messenger permite delizar conversa para arquivá-la (Imagem: Divulgação)", "link": "https://tecnoblog.net/439830/instagram-direct-facilita-ver-se-contatos-leram-sua-mensagem/"}
{"title": "Google vai ativar autenticação de dois fatores por padrão | Antivírus e Segurança | Tecnoblog", "author": "André Fogaça", "text": "O Google divulgou nesta quinta-feira (6) um plano para inserir a autenticação de dois fatores como método padrão para login de todos os usuários. A atitude é extremamente importante para a segurança de literalmente qualquer pessoa em todo canto da internet, mas para isso a ferramenta escolhida é um smartphone ou tablet que já está com as credenciais devidamente autenticadas.Como migrar contas do Google Authenticator no AndroidComo proteger a conta do Fortnite com 2FA [autenticação em duas etapas]Autenticação de dois fatores do Google (Imagem: André Fogaça/Tecnoblog)Não é de hoje que nós falamos da importância de ter autenticação de dois fatores ativada em todos os lugares que permitem essa ferramenta, pois ela pode dificultar bastante o login de uma pessoa com a senha de outra – um hacker com sua, por exemplo. Para reforçar essa importante mensagem, o Google está planejando tornar padrão o uso deste tipo de identificação do usuário que utiliza algum de seus serviços.Esse tipo de confirmação se o usuário realmente está tentando entrar em um serviço já é utilizado pelo Google por anos, mas é a pessoa que precisa ativamente se aventurar nas configurações de seu perfil e ativar a função manualmente. Nela, sempre que você fizer login em um aparelho novo, seja um computador ou mesmo outro celular ou tablet, uma tela de autenticação aparece no dispositivo já logado perguntando algo como “você realmente está tentando entrar na sua conta?”, seguido de duas respostas para “sim” ou “não”.Autenticação de dois fatores do Google (Imagem: divulgação/Google)É este método o escolhido pelo Google para reforçar a segurança de todos por padrão, desde que o checkup deste assunto esteja em dia no seu perfil – você pode conferir o seu clicando ou tocando aqui. A ferramenta já é muito objetiva e até mesmo demonstra poucas opções para justamente não confundir o usuário, mas ainda assim o gigante das buscas também aproveitou o anúncio para prometer melhorias para esse processo.Existe outra forma menos propagandeada pelo Google para fazer basicamente a mesma coisa, adicionando alguns passos para a tarefa e utilizando uma ferramenta que o próprio gigante das buscas já tem. Ela envolve um gerador de códigos ou tokens, responsáveis por exigir o preenchimento de alguns números para realizar a autenticação de dois fatores tanto em serviços da própria empresa, como em sites ou apps terceiros.Mesmo mais trabalhosa, essa ferramenta para tokens pode ser ideal quando o usuário tem sua conta conectada em mais dispositivos, como os aparelhos dos filhos ou outras pessoas e não quer nenhum deles autorizando ou negando o acesso quando o autenticador for acionado.Google sugere usar seu gerenciador de senhasAlém de entregar uma ferramenta para autenticação em dois fatores mais simples como padrão para todos, o gigante das buscas também sugere o uso de seu gerador e gerenciador de senhas, embutido no navegador Chrome. O recurso pode ser utilizado em dispositivos Android, no computador e até em um iPhone, iPod Touch ou iPad, bastando que o usuário utilize o navegador do Google nestes gadgets.Ele funciona como um criador de senhas complexas, mas ao mesmo tempo pode preencher as que sabe e pode receber estes dados de outros serviços ou aplicativos ao importar as credenciais. A ferramenta também emite alertas ao usuário quando vazamentos acontecem e sugere trocar suas informações nos sites e endereços com brechas de segurança.Enquanto o autenticador de dois fatores do Google é mais simples de utilizar, o gerenciador de senhas pode não ser o mais prático e outras opções do mercado entregam ainda mais recursos, algumas delas pagas e outras não. Alguns concorrentes envolvem uma ferramenta da própria Samsung para seus aparelhos, ou então de terceiros como 1 Password e o Dropbox.Com informações: Google.", "link": "https://tecnoblog.net/439843/google-vai-ativar-autenticacao-de-dois-fatores-por-padrao/"}
{"title": "Twitter adiciona função de gorjeta para apoiar seus perfis favoritos | Aplicativos e Software | Tecnoblog", "author": "Ana Marques", "text": "O Twitter começou a testar a função “Tip Jar”, ou “jarro de gorjetas” – a famosa caixinha. A ferramenta permite enviar e receber dinheiro de outros usuários da rede social, e chega primeiro a um grupo seleto de pessoas que usam o aplicativo em inglês, no Android e no iPhone (iOS).WhatsApp Pay chega ao Brasil para pagamentos via Nubank, Itaú e maisTwitter compra Scroll, serviço de assinatura que remove anúncios de sitesTip Jar, a ferramenta de gorjetas do Twitter (Imagem: Ana Marques/Tecnoblog)Como funciona o Tip Jar para dar gorjetas no Twitter?Quando a função estiver disponível em uma conta, será possível ver um ícone para gorjetas perto do botão Seguir, na página de perfil do usuário. Ao tocar sobre ele, você terá acesso a uma lista de serviços de pagamento ou plataformas habilitadas pela conta.Para dar o seu apoio com uma gorjeta, selecione a opção de pagamento de sua preferência e você será levado do Twitter até o app escolhido, onde poderá definir a quantia que será enviada para o dono do perfil em questão. Além de acessar o recurso pelo perfil de um usuário, quem está no Android pode enviar gorjetas dentro do Spaces.Configurando o Tip Jar no Twitter (GIF: Divulgação/Twitter)De acordo com a rede social, atualmente os serviços disponíveis incluem Bandcamp, Cash App, Patreon, PayPal e Venmo. O Twitter não cobra taxas sobre o valor transferido.Com a novidade, o Twitter pretende atrair mais criadores de conteúdo, que encontram benefícios semelhantes em outras plataformas, como o Only Fans e o próprio Facebook.DisponibilidadeDe acordo com Esther Crawford, gerente de produto sênior da empresa, os primeiros a receber serão alguns jornalistas, criadores de conteúdo, experts e organizações sem fins lucrativos. “Em breve, mais pessoas poderão adicionar o Tip Jar aos seus perfis e vamos expandir para outros idiomas”, afirmou em um comunicado no blog oficial.", "link": "https://tecnoblog.net/439864/twitter-adiciona-funcao-de-gorjeta-para-apoiar-seus-perfis-favoritos/"}
{"title": "Microsoft nunca teve lucro com consoles Xbox, mas divisão de jogos é rentável | Jogos | Tecnoblog", "author": "Murilo Tunholi", "text": "A diretora de desenvolvimento de negócios da Xbox, Lori Wright, revelou que a Microsoft nunca lucrou com a venda de consoles. A informação veio da própria diretora, ontem (5), durante um depoimento no processo judicial entre Epic Games e Apple. Mesmo sem ganhar dinheiro com hardware, Wright garantiu que a divisão de jogos ainda é rentável para a empresa de outras formas.Epic usou sucesso de Fortnite para pressionar Microsoft e GoogleO que você precisa para testar o xCloud no Brasil?Xbox Series X e S (Imagem: Divulgação/Microsoft)Convidada para testemunhar no tribunal pelo CEO da Epic Games, Tim Sweeny, a diretora da Xbox deveria falar apenas sobre a negociação negada de um app nativo do xCloud para iPhone e iPad. Porém, Wright revelou algumas informações a mais ao responder a perguntas do advogado da Apple.Em um momento do depoimento, o representante da Apple perguntou se a Microsoft lucrava com as vendas de consoles Xbox. Em resposta, Wright disse apenas que não.Logo após a sessão no tribunal, um representante da Microsoft enviou um comunicado ao The Verge. “A venda de consoles é tradicionalmente um subsídio de hardware. As empresas vendem os aparelhos com prejuízo para atrair novos clientes. Os lucros vêm da venda de jogos e assinaturas de serviços online”, explicou a empresa.A Microsoft, no entanto, não comentou se esse prejuízo vale para toda a vida útil do console — que pode durar entre cinco e oito anos —, ou se a empresa começa a lucrar em algum momento com a venda de hardware, devido à redução de preços dos componentes internos dos aparelhos.Só o Nintendo Switch gera lucros, segundo a MicrosoftO Nintendo Switch seria o único console realmente lucrativo da atual geração, segundo documentos confidenciais da Microsoft — revelados devido ao processo judicial entre Epic e Apple. A Sony, por outro lado, também não lucraria com a venda de hardware.De acordo com a Nintendo, o Switch já vendeu mais que o esperado e até ultrapassou o Game Boy Advance. No último relatório financeiro, a empresa divulgou que 84,59 milhões de unidades do videogame foram vendidas desde o lançamento, em 2017. Somente no último trimestre, a japonesa comercializou 4,73 milhões de Switches, 44% a mais do que no mesmo período em 2020.Com informações: The Verge.", "link": "https://tecnoblog.net/439865/microsoft-nunca-teve-lucro-com-consoles-xbox-mas-divisao-de-jogos-e-rentavel/"}
{"title": "Nova York quer proibir mineração de bitcoin e outras criptomoedas | Finanças | Tecnoblog", "author": "Bruno Ignacio", "text": "A mineração de bitcoin (BTC) e de outras criptomoedas vem se tornando um problema energético e ambiental para governos em todo o mundo. Nesta última segunda-feira (03), um novo projeto de lei foi apresentado ao Senado do Estado de Nova York com o objetivo de proibir a atividade na região por três anos, período no qual as autoridades deverão avaliar todos os impactos climáticos e econômicos dessas operações.Mineração de bitcoin na China deve gerar 130 milhões de toneladas de CO2 até 2024O que é blockchain? [indo além do bitcoin]Mineração de bitcoin (imagem: Consulting 24/Flickr)Mineração de bitcoin consome mais energia que ArgentinaPara que as redes blockchain que sustentam as moedas digitais funcionem, é necessário que incontáveis máquinas no mundo todo cedam seu poder de processamento para criptografar e registrar todas as operações. Essa é a mineração de criptomoedas, que por sua vez demanda muita eletricidade para manter esses computadores funcionando 24 horas por dia.De acordo com o Centro de Finanças Alternativas da universidade de Cambridge, somente a mineração de bitcoin consome cerca de 142 TWh (terawatts-hora), valor que supera o gasto energético de países inteiros, como a Ucrânia e Argentina. Porém, o principal fator poluente dessa atividade é que mais de 60% dela é realizada na China, onde a maior parte das usinas elétricas funcionam a base da queima de carvão.O Bitcoin Energy Consumption Index, da plataforma Digiconomist, aponta que a mineração da criptomoeda libera cerca de 53 megatons de dióxido de carbono por ano, o equivalente a todas as emissões da Suécia. Agora, o norte do estado de Nova York se tornou um foco de mineradores de bitcoin e o governo espera um aumento contínuo da atividade no curto prazo.Projeto proibiria mineração em Nova York por 3 anosPor isso, o senador Kevin Parker criou um projeto de lei para proibir a mineração de bitcoin e de criptomoedas em todo o estado de Nova York por pelo menos três anos. Caso o texto atual seja aprovado, a atividade se tornaria ilegal na região durante o período determinado, no qual as autoridades conduziriam pesquisas para avaliar a liberação de gases poluentes, impactos no consumo de eletricidade e efeitos na fauna e flora local relacionados à mineração.Com a pesquisa concluída, o resultado seria divulgado publicamente para que a população (e os próprios mineradores) possam comentar o projeto de lei durante quatro meses. Após a análise das respostas, os legisladores entrariam em um período de avaliação de propostas de regulamentações para frear a poluição relacionada à mineração de criptomoedas.Duas cidades se tornam polos de mineração e poluiçãoDuas cidades no estado de Nova York chamaram a atenção. Dresden e Alcoa se tornaram polos de mineração e de poluição atmosférica. Nos últimos anos, algumas organizações mineradores de bitcoin adaptaram antigas e poluentes usinas de energia para que fornecessem eletricidade para milhares de máquinas que permanecem ligadas 24 horas por dia. Algumas instalações ainda contribuem para a rede locald, mas a maioria funciona exclusivamente para alimentar os galpões de mineração.Roger Downs, diretor de conservação na ONG ambiental Sierra Club, disse ao Gizmodo que a recentemente aprovada Lei de Liderança Climática e Proteção Comunitária ironicamente serviu como um dos fatores que impulsionou a mineração de criptomoedas no estado de Nova York.“Com a nova lei climática, estamos claramente nos afastando da geração de energia com combustíveis fósseis e tentando construir opções renováveis”, disse ele, apontando que a última usina a carvão em Nova York foi oficialmente fechada no ano passado. Porém, a iniciativa também liberou diversas instalações para que mineradores posteriormente as ocupassem.Para ele, esse recente surto na mineração na região é resultado das pessoas se aproveitando de usinas anteriormente desativadas. “Eles tiram vantagem disso causando intensas emissões de carbono, mas isso é permitido pelas brechas em nossos regulamentos”, concluiu Downs.Com informações: Gizmodo", "link": "https://tecnoblog.net/439780/nova-york-quer-proibir-mineracao-de-bitcoin-e-outras-criptomoedas/"}
